Revit 2026 API

# SystemsAnalysisOptionsWeatherFile Property

---

The file name of the EnergyPlus weather (*.epw).

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string WeatherFile { get; set; }
```
```vb
Public Property WeatherFile As String
	Get
	Set
```
```cpp
public:
property String^ WeatherFile {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member WeatherFile : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The analysis requires a valid EnergyPlus weather (.epw) file. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

When requesting a new system analysis, it is okay to have an empty weather file in the SystemsAnalysisOption. In that case, the ViewSystemsAnalysisReport would use the weather file at the current site location.

#### Reference

SystemsAnalysisOptions Class

Autodesk.Revit.DB.Analysis Namespace